# 180.168.146.187:10201
# 180.168.146.187:10211
# 180.168.146.187:10130
# 180.168.146.187:10131

ACCOUNT_SETTING = {
    "account_name_01": 
    {
        "用户名": "083231",
        "密码": "wodenvshen199!",
        "经纪商代码": "9999",
        "交易服务器": "180.168.146.187:10201",
        "行情服务器": "180.168.146.187:10211",
        "产品名称": "0000000000000000",
        "授权编码": "0000000000000000",
        "Gateway": "CtpGateway"
    },
    "account_name_02": 
    {
        "用户名": "201414",
        "密码": "wodenvshen199!",
        "经纪商代码": "9999",
        "交易服务器": "180.168.146.187:10201",
        "行情服务器": "180.168.146.187:10211",
        "产品名称": "0000000000000000",
        "授权编码": "0000000000000000",
        "Gateway": "CtpGateway"
    }
}

FILE_SETTING = {
    "ORDER_DIR_PATH": "",
    "BACKUP_DIR_PATH": "",
    "POSITION_DIR_PATH": "",
    "LOG_DIR_PATH": ""
}


TWAP_SETTING = {
    "TIME": 60,
    "INTERVAL": 30
}

AM_SYMBOL = ["UR","JD","AP","SM","SF","LH"]